{"data":{"markdownRemark":{"html":"<p>A <strong>conventional processor</strong> converts all the inputs of keyboard into binary numbers (0s and 1s in the form of\nelectrical pulses) and from then on its function involves the movement and transformation of these pulses in simple electrical circuits. The limits of conventional computers is that , they cannot solve intractable problems like NP-complete problems and for example they are irreversible. From a computer theoretic review of this answer see below</p>\n<h3>Ultimate physical limits to computation</h3>\n<p>Seth Loydd's ultimate laptop is a super hot computer\nThe acutal limit is not Moore's Law but the uncertainty principle in terms of the time scale. Which limits the <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.10764em;\">f</span></span></span></span>\nTimeflops\nzetaflops ....\n10^50</p>\n<p>The purpose of the article was to determine just what limits the laws of physics place on the power of computers.</p>\n<div style=\"background:#D4D3D3; padding: 10px; margin: 40px; box-shadow: 0 6px 8px 0 rgba(0,0,0,0.2)\"> \nIs physical phenomena a computation, flower, chemical reaction, a computation?\nSo a flower is a computer in this sense. So for this article e will look at different models of computing that in deep study.</div>\n<p><a href=\"https://phys.org/news/2018-12-amoeba-approximate-solutions-np-hard-problem.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://phys.org/news/2018-12-amoeba-approximate-solutions-np-hard-problem.html</a>.</p>\n<p><strong>Unconventional Computing</strong> is computing by a wide range of nonheuristic or unusual methods. Mechanical computers retain some interest today both in research and as analogue computers. Great fathers of computing Von Neumann computer architecture and the Turing machine. This computing is often time-based, analog computation was conventional half-a-century ago,\nthen digital computing came to power, and now the analog computation is ‘unconventional.’ Currently quantum computing is the unconventional aside for classical computing. It is almost the science fiction of computing. </p>\n<p>The world of atoms and bits</p>\n<p>Stephen Wolfram's little worlds have consistent bandwidths between their parts. A very different example comes from Seth Lloyd and his \"ultimate laptop,\" in which he thought of various pieces of physicality (including even a black hole) as if they were fundamentally doing computation and asked how powerful these purported computers might be.</p>\n<h1>Biological Computing</h1>\n<p>Since everything is computing, it is better to start looking at information processing in different regimes.</p>\n<p> In morphological plant processors data are represented by initial configuration of roots and configurations of sources of attractants and repellents; results of computation are represented by topology of the roots’ network. Computation is implemented by the roots following gradients of attractants and repellents.\nThey continuously make distributed processing of sensory information, concurrent decision making and parallel actuation. T</p>\n<p>Quantum effects in Biological Environments (QuBE)\nChange the paradigm of biomimetic sensor development\nPhotosynthetic apparatus:\nCoherent quantum transport\nincreases the rate and\nefficiency of exciton transport\nDavydov's view in Biology and Quantum Mechanics (Davydov, 1982) was that quantum mechanics is most relevant for isolated systems in pure states and therefore is of little importance for biological systems that are in statistical states at thermal equilibrium.\nWhen a plant solves a very hard mathematical problem, that's unconverntional and yes its also computing. A class of computing compo</p>\n<p>In this book is mentioned quantum computing, mechanical computing, biocomputing and neuromorphic computing. <a href=\"https://link.springer.com/referencework/10.1007%2F978-1-4939-6883-1\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://link.springer.com/referencework/10.1007%2F978-1-4939-6883-1</a></p>\n<h3>What we learned from micro-organisms that solve intractable problems</h3>\n<p>This question is also relevant for issues of intractability in cognitive science. It is conjectured that no NP-hard problem can be tractably computed by quantum computation.</p>\n<p>The amoeba solving the TSP NP-hard problem is a beautiful and shocking example of this principles described in this snippet. </p>\n<p>It is expected that no NP-hard problem is tractably computable by quantum computer. </p>\n<h3>NP-complete Problems and Physical Reality</h3>\n<p><a href=\"https://www.scottaaronson.com/papers/npcomplete.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://www.scottaaronson.com/papers/npcomplete.pdf</a></p>\n<p>(see quote tweet for more details).\nAt this  moment I would like to echoe the deep ethos by Social Capital</p>\n<p> there are\na lot of hard problems in the world that computers cannot solve, but that biology can.\nFor many of these problems, the highest-potential path to fixing them lies in the overlap of\ncomputers and biology: computational biology. Computational biology is an emerging discipline\nthat generally refers to two overlapping fields: 1) the practice of taking everything we’ve learned\nabout how to build computers and applying that knowledge to building cells as a programmable,\nflexible, platform with which we can do useful work, and 2) productizing and automating the\ntools, processes, and methods we use in the lab to manipulate biology and build living systems.\nAlthough we’ve gone through a few waves of “biotech bubbles” over the past twenty years, this\ntime may no longer only be about wildly speculative drug development, but instead about\nsomething more concrete and foundational. We'll be able to establish biological systems as\nengineered, all-purpose platforms that we can put to work the same way we do with computers.\nAdditionally, within a few years, we’ll reach a convergence point where our recent advances will\nstart to overlap, and eventually blend, into our existing computing frameworks and\ninfrastructure. This will have a profound and disruptive effect on many fields such as drug design\nand discovery, drug delivery, precision diagnostics and healthcare, engineered materials,\necology, agriculture, and much more. We’ll be able to work with biology in ways that\nincreasingly resemble the way we work with software: as a platform for building tools,\napplications, and infrastructure. This time, however, we’ll be able to do it using living systems\ninstead of code.</p>\n<p>Social Capital </p>\n<p>Digital machines generally beat cells for information processing jobs that demand precision and efficiency. But for jobs that require redundancy, adaptability and resilience in the face of the unknown? Living systems ftw. </p>\n<h3>Cellular Automata</h3>\n<h3>smart actuators</h3>\n<p>molecular motors and machines with computational abilities, intelligent arrays of\nactuators, molecular actuators, coupling unconventional computing devices with arrays of\nmolecular or smart-polymer actuators.\nchemistry-based computing (amorphous computing, implementation of logical functions, image\nprocessing and pattern recognition in reaction-diffusion chemical systems and networks of chemical\nreactors);\nbiological and molecular computing (conformation-based computing, DNA computing,\ninformation processing in micro-tubules, molecular memory, biochemical computing, artificial\nchemistry, etc.);\n• hybrid and non-silicon computation (plastic computers, organic semiconducting devices, neuronal\ntissue-silicon hybrid processors);\n• logics of unconventional computing (logical systems derived from space-time behavior of natural\nsystems, non-classical logics, logical reasoning in physical, chemical and biological systems);\n• physics-based computation (analogue computation, quantum computing, collision-based\ncomputing with solitons);\n• stigmergic and population-based computing (optimization in cellular cultures, computing in\nsocieties of social insects, ecological computing);</p>\n<h1>Liquid Computing</h1>\n<p>This study is ongoing in bioengineering. </p>\n<p>This is  a\nIn his paper , <b>Andre Adamatzky</b> develops a treatise by introducing this method: </p>\n<p>A liquid can be used to represent signals, actuate mechanical computing devices and to modify\nsignals via chemical reactions. </p>\n<p><em>A liquid is an incompresible substance offering no resistance to a shear deformation.</em></p>\n<blockquote>\n<p>Computation is verily based on manipulation of information, this laws of information computing are based on the laws of physics like entropy and sometimes man-made laws like Moore's Law. Bits are physical entities, and sometimes qubits are mesoscopic. Manipulating Matter vs Manipulating Information</p>\n</blockquote>\n<h2>water-droplet computer</h2>\n<iframe width=\"640\" height=\"480\" src=\"https://www.youtube.com/embed/m5WodTppevo\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<h1>Spatial Computing</h1>\n<p>Is adequately a child of <strong>ubiquitous computing</strong>, meaning</p>\n<h1>Post-Moore's Law Computing</h1>\n<p>With a clear limit to how small we could get transistors small.Also energy dissipation is a general concern for classical computing.\nAs always we cannot beat physics. </p>\n<p>With the end of transistor scaling now in sight, the raw energy efficiency (and thus, practical performance) of conventional digital computing is expected to soon platea</p>\n<p> It's not a law of nature; it's just an observation about technological progress, where the size of the components in the computer gets smaller by a factor of two every couple of years and the number of components doubles. Quantum computers haven't been obeying Moore's law. The reason is that to build quantum bits and put them together is a difficult process: You're operating at the most microscopic scale. It's tough to do. You have to control things very precisely.</p>\n<h1>Liquid Computing</h1>\n<p><a href=\"https://royalsocietypublishing.org/doi/full/10.1098/rstb.2018.0372\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://royalsocietypublishing.org/doi/full/10.1098/rstb.2018.0372</a></p>\n<h1>Quantum Computing</h1>\n<p>A qubit </p>\n<p>Simulating quantum effects on a classical computer, and creating</p>\n<p>NISQ</p>\n<p>With this subject I would sway to a different point of view by observing quantum effects on classical computers.\nRichard P. Feynman famously asked:\nWhat kind of computer are we going to use to\nsimulate physics?\nI would like to have the elements of this computer locally interconnected, and therefore sort of think about cellular automata as an example </p>\n<h2>Photonic (Optical)</h2>\n<p>In a lecture titled Simulating Physics with Computers, Professor Feynman talked about why physicists need computers, and what they require of these devices</p>\n<p><a href=\"https://people.eecs.berkeley.edu/~christos/classics/Feynman.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://people.eecs.berkeley.edu/~christos/classics/Feynman.pdf</a></p>\n<h1>Reversible Computing</h1>\n<p>A reversible computing is a one where initial state is, like an elastic ball . This gives an idea that there is a correlation between information and energy. The physical world tells us information in terms of how we do computation. </p>\n<p>Fredkin gates, which are  reversible gates can be able to generate no heat.\nErasure is the main contributer to energy dissipation, not ccomputation.</p>\n<p>Computers are heat engines that take energy, E, and “work out”, W, the solution to a problem. Real\ncomputers however also dissipate heat, Q.\n<span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>E</mi><mo>−</mo><mi>W</mi><mo>=</mo><mi>Q</mi></mrow><annotation encoding=\"application/x-tex\">E-W=Q</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.76666em;vertical-align:-0.08333em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">E</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">−</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8777699999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">Q</span></span></span></span></p>\n<p>In the 1940's , Physicists asked why computers use so much energy?\nIn 1961, Rolf Landauer at IBM gave a seminal paper answering that question by infering thermodynamics.</p>\n<h2></h2>\n<p>The great blog muse Scott Aaronson has posted on the subject:  <a href=\"https://www.scottaaronson.com/blog/?p=3327\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Is Information Physical? How do computers forget?</a></p>\n<p> Jacob Bekenstein  wherever and whenever it occurs in the physical world, takes up a minimum amount of space.  \"holography\" is the name of the bound that would cover the ultimate quantum gravity version of the information surface bound we already know about for sure. More preciscely the holographic entropy bound, which says that the number of (qu)bits is at most A/(4 ln 2), where A is the area of a bounding surface in Planck units.</p>\n<p>I find this idea particularly disturbing. Generally speaking a volume should tell us more information it could hold, and it's strange to get the answer instead from the area of the surface that surrounds it.\nbecause if you try to pack information too densely into a given volume, it collapses to form a black hole.\n(The amount of information is 1/4 the area in Planck units, by the way, which should sound familiar to people who have been following work on how to count entropy on the surfaces of black holes.)</p>\n<p>Bateson's definition of information: \"A difference that makes a difference.\"</p>\n<p> any information that’s spatially localized at all, can only be localized so precisely.</p>\n<p>Information loss from a computation implies energy dissipation due to <a href=\"https://arxiv.org/pdf/1006.1420.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Landauer’s Principle</a>. </p>\n<p>Landauer didn’t state his theorem explicitly. Instead (32a) is a condensed form of arguments presented in section\n“4. Logical irreversibility and entropy generation” of his article [13].\nIn this section Landauer considers the example of the restore\nto one operation, and argues\nIf a logical operation reduces the information entropy of the processed data by <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>δ</mi><mi>H</mi><mo>=</mo><mo>−</mo><mi>b</mi><mi>i</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">\\delta H = -bit</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span><span class=\"mord mathdefault\" style=\"margin-right:0.08125em;\">H</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.77777em;vertical-align:-0.08333em;\"></span><span class=\"mord\">−</span><span class=\"mord mathdefault\">b</span><span class=\"mord mathdefault\">i</span><span class=\"mord mathdefault\">t</span></span></span></span> then the thermodynamic entropy of the hardware,\nwhich implements that logical operation, is reduced\nby minimum</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi mathvariant=\"normal\">Δ</mi><mi>S</mi><mo>=</mo><mo>−</mo><mi>k</mi><mi>ln</mi><mo>⁡</mo><mn>2</mn></mrow><annotation encoding=\"application/x-tex\">\\Delta S = -k\\ln 2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\">Δ</span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.77777em;vertical-align:-0.08333em;\"></span><span class=\"mord\">−</span><span class=\"mord mathdefault\" style=\"margin-right:0.03148em;\">k</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mop\">ln</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">2</span></span></span></span></p>\n<p>Irreversibility places a lower limit on energy consumption.  <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>Q</mi><mo>≥</mo><mi>ln</mi><mo>⁡</mo><mn>2</mn><msub><mi>k</mi><mi>B</mi></msub><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">Q \\ge \\ln 2 k_BT</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8777699999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">Q</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">≥</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.84444em;vertical-align:-0.15em;\"></span><span class=\"mop\">ln</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">2</span><span class=\"mord\"><span class=\"mord mathdefault\" style=\"margin-right:0.03148em;\">k</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03148em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.05017em;\">B</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">T</span></span></span></span></p>\n<p>Erasure of information\nThe markovian regime</p>\n<p>This field hasn't recieved much attention , its like the climate change of computing, without the speculativism. </p>\n<p>It might not be a surprise that one of the most efficient computers we seek always wanted to have been in our presence and  has been here before we thought of creating one. </p>\n<p>To some extend, when you give a perfect machine a good proglem, it's no longer a problem but an input to its generic instruction set. For example , a matrix computes according to the linear operation provided to it. These type of machines are created to solve specific problems. </p>\n<h1>Optomechanical Computing</h1>\n<h1>Black-Hole Computing</h1>\n<p>This is important because time-reversal is not applicable to black-holes. </p>\n<p>This is were qc will become limited thoroughly.\nHarlow-Hayden(2013) showed that to  The limits of quantum computing will be in finding collisions in a <b style=\"color: blue\"> cryptographic hash functions</b>, this function is mapping a string to a much simpler string. So it should not be injective one-way function.  </p>\n<p>The problem of decoding information with Hawking Radiation on the event horizon. </p>\n<p>This might be an interesting way to encrypt information.\nthen black holes could in principle be ‘programmed’:\none forms a black hole whose initial conditions encode the information to be processed,\nlets that information be processed by the Planckian dynamics at the hole’s horizon, and\ngets out the answer to the computation by examining the correlations in the Hawking\nradiation emitted when the hole evaporates</p>\n<p>Biological systems have a function(<em>teliology</em>) and a dynamic.</p>\n<p>The amoeba is an analog computer that can ofcourse behave as a quantum system, since all physical systems ae quantum systems. </p>\n<p><a href=\"https://news.ycombinator.com/item?id=18735903\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://news.ycombinator.com/item?id=18735903</a>\n<a href=\"https://twitter.com/IrisVanRooij/status/1079520922384695296\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://twitter.com/IrisVanRooij/status/1079520922384695296</a></p>\n<h1>Relativity Computing</h1>\n<p>Using Einsteins theory of relativity we can set a problem and time , say <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">T</span></span></span></span> to solve it. The computer start on the intractable problem, then take a spaceship and\naccelerate to nearly the speed of light(<span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>c</mi></mrow><annotation encoding=\"application/x-tex\">c</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">c</span></span></span></span>). When you return to Earth, the answer to your problem will be waiting for you. </p>\n<p>The timeelapsed on your computer would be <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><msub><mi>t</mi><mtext>computer</mtext></msub><mo>=</mo><mfrac><mi>t</mi><msqrt><mrow><mn>1</mn><mo>−</mo><msup><mi>v</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mrow><annotation encoding=\"application/x-tex\">t_{\\text{computer}}= \\dfrac{t}{\\sqrt{1-v^2}}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.9011879999999999em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathdefault\">t</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.28055599999999997em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord text mtight\"><span class=\"mord mtight\">computer</span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:2.22208em;vertical-align:-0.93em;\"></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:1.29208em;\"><span style=\"top:-2.196611em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord sqrt\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.913389em;\"><span class=\"svg-align\" style=\"top:-3em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\" style=\"padding-left:0.833em;\"><span class=\"mord\">1</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">−</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mord\"><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">v</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.740108em;\"><span style=\"top:-2.9890000000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span></span></span><span style=\"top:-2.873389em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"hide-tail\" style=\"min-width:0.853em;height:1.08em;\"><svg width='400em' height='1.08em' viewBox='0 0 400000 1080' preserveAspectRatio='xMinYMin slice'><path d='M95,702c-2.7,0,-7.17,-2.7,-13.5,-8c-5.8,-5.3,-9.5,\n-10,-9.5,-14c0,-2,0.3,-3.3,1,-4c1.3,-2.7,23.83,-20.7,67.5,-54c44.2,-33.3,65.8,\n-50.3,66.5,-51c1.3,-1.3,3,-2,5,-2c4.7,0,8.7,3.3,12,10s173,378,173,378c0.7,0,\n35.3,-71,104,-213c68.7,-142,137.5,-285,206.5,-429c69,-144,104.5,-217.7,106.5,\n-221c5.3,-9.3,12,-14,20,-14H400000v40H845.2724s-225.272,467,-225.272,467\ns-235,486,-235,486c-2.7,4.7,-9,7,-19,7c-6,0,-10,-1,-12,-3s-194,-422,-194,-422\ns-65,47,-65,47z M834 80H400000v40H845z'/></svg></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.12661100000000003em;\"><span></span></span></span></span></span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.677em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord mathdefault\">t</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.93em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span></span></span></span>.  To increase this time , we would need to let <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>v</mi><mo>→</mo><mi>c</mi><mtext>  </mtext><mo>⟹</mo><mtext>  </mtext><mi>E</mi><mo>=</mo><mi>m</mi><msup><mi>c</mi><mn>2</mn></msup></mrow><annotation encoding=\"application/x-tex\">v \\to c \\implies E= mc^2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">v</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.549em;vertical-align:-0.024em;\"></span><span class=\"mord mathdefault\">c</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">⟹</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">E</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8141079999999999em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">m</span><span class=\"mord\"><span class=\"mord mathdefault\">c</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141079999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span></span></span></span>, the energy also increases with time. </p>\n<p>Malament and Hogarth have demonstrated that such a standard could solve the [Halting Problem]</p>\n<h4>NB: Similar remarks apply to traveling close to a black hole event horizon: if you got exponentially close then you would need exponential energy to escape. Much contents around this area are limited by considering interaction for lengths less than Plancks constant</h4>\n<h1>Anhtropic Computing</h1>\n<h2>Suicide Computing</h2>\n<blockquote>\n<p>The anthropic principle is a philosophical consideration that observations of the Universe must be compatible with the conscious and sapient life that observes it.</p>\n</blockquote>\n<blockquote>\n<p> given a formula ϕ, guess a random assignment x, then kill yourself if x does not satisfy ϕ. Conditioned on looking at anything at all, you will be looking at a satisfying assignment! Some would argue that this algorithm works even better if we assume the many-worlds interpretation of quantum mechanics.</p>\n</blockquote>\n<p> For according to\nthat interpretation, with probability 1, there really is a universe in which you guess a satisfying\nassignment and therefore remain alive. Admittedly, if ϕ is unsatisfiable, you might be out of luck.\nBut this is a technicality: to fix it, simply guess a random assignment with probability 1 − 2\n−2n\n,\nand do nothing with probability 2−2n\n. If, after the algorithm is finished, you find that you have not\ndone anything, then it is overwhelmingly likely that ϕ is unsatisfiable, since otherwise you would\nhave found yourself in one of the universes where you guessed a satisfying assignment.</p>\n<div style=\"background:#D4D3D3; padding: 10px; margin: 40px; box-shadow: 0 6px 8px 0 rgba(0,0,0,0.2)\">  I propose the term **anthropic computing** for any model of computation in which the probability of one’s own existence might depend on a computer’s output. The name comes from the anthropic principle in cosmology, which states that certain things are the way they are because if they were different, then we would not be here to ask the question. Just as the anthropic principle raises difficult questions about the nature of scientific explanations, so anthropic computing raises similar questions about the nature of computation. </div>\n# Phenotropic Computing\nPheno means `tropic`\nEasily this could be understood as the reverse of neaural networks found in machine learning. \nThese pioneers were deeply interested in probabilistic architectures and the development of techniques similar to what Lanier calls phenotropic codes. \n<p>Lanier's surface-based model, as temporal codes are fundamental properties of neural computation\nThe world as our nervous systems know it is not based on single point measurements, but on surfaces. Put another way, our environment has not necessarily agreed with our bodies in advance on temporal syntax. Our body is a surface that contacts the world on a surface. For instance, our retina sees multiple points of light at once.</p>\n<p>So in a sense a phenotropic algorithm is a reversible algorithm since we can ask what were the inputs given to a neural net. </p>\n<h1>Credits</h1>\n<p>Linked Lists </p>","frontmatter":{"path":"/unconventing","title":"Unconventional Computing","date":"2014-03-23"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/unconventing/"}}