{"data":{"markdownRemark":{"html":"<p>When a plant solves a very hard mathematical problem, that's unconverntional and yes its also computing. A class of computing compo</p>\n<p>In this book is mentioned quantum computing, mechanical computing, biocomputing and neuromorphic computing. <a href=\"https://link.springer.com/referencework/10.1007%2F978-1-4939-6883-1\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://link.springer.com/referencework/10.1007%2F978-1-4939-6883-1</a></p>\n<h1>Moore's Law</h1>\n<p>With a clear limit to how small we could get transistors small.Also energy dissipation is a general concern for classical computing.\nAs always we cannot beat physics. </p>\n<p>With the end of transistor scaling now in sight, the raw energy efficiency (and thus, practical performance) of conventional digital computing is expected to soon platea</p>\n<p> It's not a law of nature; it's just an observation about technological progress, where the size of the components in the computer gets smaller by a factor of two every couple of years and the number of components doubles. Quantum computers haven't been obeying Moore's law. The reason is that to build quantum bits and put them together is a difficult process: You're operating at the most microscopic scale. It's tough to do. You have to control things very precisely.</p>\n<h4>Ultimate physical limits to computation</h4>\n<p>Seth Loydd's ultimate laptop is a super hot computer\nThe acutal limit is not Moore's Law but the uncertainty principle in terms of the time scale. Which limits the <span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.10764em;\">f</span></span></span></span>\nTimeflops\nzetaflops ....\n10^50</p>\n<p>The purpose of the article was to determine just what limits the laws of physics place on the power of computers.</p>\n<h2>Quantum Computing</h2>\n<p>With this subject I would sway to a different point of view by observing quantum effects on classical computers. </p>\n<h2>Reversible Computing</h2>\n<p>A reversible computing is a one where initial state is, like an elastic ball . This gives an idea that there is a correlation between information and energy. The physical world tells us information in terms of how we do computation. </p>\n<p>Fredkin gates, which are  reversible gates can be able to generate no heat.\nErasure is the main contributer to energy dissipation, not ccomputation.</p>\n<p>Computers are heat engines that take energy, E, and “work out”, W, the solution to a problem. Real\ncomputers however also dissipate heat, Q.\n<span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mi>E</mi><mo>−</mo><mi>W</mi><mo>=</mo><mi>Q</mi></mrow><annotation encoding=\"application/x-tex\">E-W=Q</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.76666em;vertical-align:-0.08333em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">E</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">−</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8777699999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">Q</span></span></span></span></p>\n<p>Information loss from a computation implies energy dissipation due to Landauer’s Principle. Since\nThe markovian regime</p>\n<p>This field hasn't recieved much attention , its like the climate change of computing, without the speculativism. </p>\n<p>It might not be a surprise that one of the most efficient computers we seek always wanted to have been in our presence and  has been here before we thought of creating one. </p>\n<p>To some extend, when you give a perfect machine a good proglem, it's no longer a problem but an input to its generic instruction set. For example , a matrix computes according to the linear operation provided to it. These type of machines are created to solve specific problems. </p>\n<h2>Optomechanical Computing</h2>\n<h2>Phenotropic Computing</h2>\n<h2>Black-Hole Computing</h2>\n<p>This might be an interesting way to encrypt information.\nthen black holes could in principle be ‘programmed’:\none forms a black hole whose initial conditions encode the information to be processed,\nlets that information be processed by the Planckian dynamics at the hole’s horizon, and\ngets out the answer to the computation by examining the correlations in the Hawking\nradiation emitted when the hole evaporates</p>\n<p>Biological systems have a function(<em>teliology</em>) and a dynamic.</p>\n<p>The amoeba is an analog computer that can ofcourse behave as a quantum system, since all physical systems ae quantum systems. </p>\n<p><a href=\"https://news.ycombinator.com/item?id=18735903\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://news.ycombinator.com/item?id=18735903</a>\n<a href=\"https://twitter.com/IrisVanRooij/status/1079520922384695296\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://twitter.com/IrisVanRooij/status/1079520922384695296</a></p>\n<h2>What we learned from micro-organisms that solve intractable problems</h2>\n<p>This question is also relevant for issues of intractability in cognitive science. It is conjectured that no NP-hard problem can be tractably computed by quantum computation.</p>\n<p>The amoeba solving the TSP NP-hard problem is a beautiful and shocking example of this principles described in this snippet. </p>\n<p>It is expected that no NP-hard problem is tractably computable by quantum computer. </p>\n<h2>NP-complete Problems and Physical Reality</h2>\n<p><a href=\"https://www.scottaaronson.com/papers/npcomplete.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://www.scottaaronson.com/papers/npcomplete.pdf</a></p>\n<p>(see quote tweet for more details).\nAt this  moment I would like to echoe the deep ethos by Social Capital</p>\n<p> there are\na lot of hard problems in the world that computers cannot solve, but that biology can.\nFor many of these problems, the highest-potential path to fixing them lies in the overlap of\ncomputers and biology: computational biology. Computational biology is an emerging discipline\nthat generally refers to two overlapping fields: 1) the practice of taking everything we’ve learned\nabout how to build computers and applying that knowledge to building cells as a programmable,\nflexible, platform with which we can do useful work, and 2) productizing and automating the\ntools, processes, and methods we use in the lab to manipulate biology and build living systems.\nAlthough we’ve gone through a few waves of “biotech bubbles” over the past twenty years, this\ntime may no longer only be about wildly speculative drug development, but instead about\nsomething more concrete and foundational. We'll be able to establish biological systems as\nengineered, all-purpose platforms that we can put to work the same way we do with computers.\nAdditionally, within a few years, we’ll reach a convergence point where our recent advances will\nstart to overlap, and eventually blend, into our existing computing frameworks and\ninfrastructure. This will have a profound and disruptive effect on many fields such as drug design\nand discovery, drug delivery, precision diagnostics and healthcare, engineered materials,\necology, agriculture, and much more. We’ll be able to work with biology in ways that\nincreasingly resemble the way we work with software: as a platform for building tools,\napplications, and infrastructure. This time, however, we’ll be able to do it using living systems\ninstead of code.</p>\n<p>Social Capital </p>\n<p>Digital machines generally beat cells for information processing jobs that demand precision and efficiency. But for jobs that require redundancy, adaptability and resilience in the face of the unknown? Living systems ftw. </p>","frontmatter":{"path":"/halcyon","title":"Unconventional Computing","date":"2014-03-23"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/halcyon/"}}