{"data":{"markdownRemark":{"html":"<h1>Echo</h1>\n<h2>Echoe</h2>\n<h3>Echoee</h3>\n<p><em>sd</em>\n<strong>sd</strong></p>\n<blockquote>\n<p>from Jean Baudrillard, Selected Writings, ed. Mark Poster (Stanford; Stanford University Press, 1988), pp.166-184.</p>\n</blockquote>\n<p><a href=\"https://www.ccis.northeastern.edu/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Northeastern University</a>\nA minimal, dark blue theme for VS Code, Sublime Text, Atom, iTerm, and more. Available on <a href=\"https://marketplace.visualstudio.com/items?itemName=brittanychiang.halcyon-vscode\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Visual Studio Marketplace</a>, <a href=\"https://packagecontrol.io/packages/Halcyon%20Theme\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Package Control</a>, <a href=\"https://atom.io/themes/halcyon-syntax\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Atom Package Manager</a>, and <a href=\"https://www.npmjs.com/package/hyper-halcyon-theme\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">npm</a>.</p>\n<p>The simulacrum is never that which conceals the truth--it is the truth which conceals that there is none.</p>\n<p>[\\int G(s)=  Sim_ p]</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><msub><mi>F</mi><mi>x</mi></msub></mrow><annotation encoding=\"application/x-tex\">F_x</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.83333em;vertical-align:-0.15em;\"></span><span class=\"mord\"><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">F</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.151392em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.13889em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\">x</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>\nThe simulacrum is true.</p>\n<p><code>Sectionalise &#x3C; f --></code></p>\n<p>Ecclesiastes</p>\n<iframe width=\"701\" height=\"480\" src=\"https://www.youtube.com/embed/YCe1gC5VaW4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\nIf we were able to take as the finest allegory of simulation the Borges tale where the cartographers of the Empire draw up a map so detailed that it ends up exactly covering the territory (but where, with the decline of the Empire this map becomes frayed and finally ruined, a few shreds still discernible in the deserts - the metaphysical beauty of this ruined abstraction, bearing witness to an imperial pride and rotting like a carcass, returning to the substance of the soil, rather as an aging double ends up being confused with the real thing), this fable would then have come full circle for us, and now has nothing but the discrete charm of second-order simulacra.l\n<p>Abstraction today is no longer that of the map, the double, the mirror or the concept. Simulation is no longer that of a territory, a referential being or a substance. It is the generation by models of a real without origin or reality: a hyperreal. The territory no longer precedes the map, nor survives it. Henceforth, it is the map that precedes the territory - precession of simulacra - it is the map that engenders the territory and if we were to revive the fable today, it would be the territory whose shreds are slowly rotting across the map. It is the real, and not the map, whose vestiges subsist here and there, in the deserts which are no longer those of the Empire, but our own. The desert of the real itself.</p>\n<p>In fact, even inverted, the fable is useless. Perhaps only the allegory of the Empire remains. For it is with the same imperialism that present-day simulators try to make the real, all the real, coincide with their simulation models. But it is no longer a question of either maps or territory. Something has disappeared: the sovereign difference between them that was the abstraction's charm. For it is the difference which forms the poetry of the map and the charm of the territory, the magic of the concept and the charm of the real. This representational imaginary, which both culminates in and is engulfed by the cartographer's mad project of an ideal coextensivity between the map and the territory, disappears with simulation, whose operation is nuclear and genetic, and no longer specular and discursive. With it goes all of metaphysics. No more mirror of being and appearances, of the real and its concept; no more imaginary coextensivity: rather, genetic miniaturization is the dimension of simulation. The real is produced from miniaturized units, from matrices, memory banks and command models - and with these it can be reproduced an indefinite number of times. It no longer has to be rational, since it is no longer measured against some ideal or negative instance. It is nothing more than operational. In fact, since it is no longer enveloped by an imaginary, it is no longer real at all. It is a hyperreal: the product of an irradiating synthesis of combinatory models in a hyperspace without atmosphere.</p>\n<p>In this passage to a space whose curvature is no longer that of the real, nor of truth, the age of simulation thus begins with a liquidation of all referentials - worse: by their art)ficial resurrection in systems of signs, which are a more ductile material than meaning, in that they lend themselves to all systems of equivalence, all binary oppositions and all combinatory algebra. It is no longer a question of imitation, nor of reduplication, nor even of parody. It is rather a question of substituting signs of the real for the real itself; that is, an operation to deter every real process by its operational double, a metastable, programmatic, perfect descriptive machine which provides all the signs of the real and short-circuits all its vicissitudes. Never again will the real have to be produced: this is the vital function of the model in a system of death, or rather of anticipated resurrection which no longer leaves any chance even in the event of death. A hyperreal henceforth sheltered from the imaginary, and from any distinction between the real and the imaginary, leaving room only for the orbital recurrence of models and the simulated generation of difference.</p>","frontmatter":{"path":"/simulacra","title":"Simulacra VR","date":"2014-03-23"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/simulacra/"}}